namespace Helpdesk.Domain.Constants;

public class ConstantStings {
    public const string TechnicalSupportContacts = "Уважаемые студенты и сотрудники!\n\nЕсли у вас возникли вопросы или проблемы с IT-оборудованием или программным обеспечением, пожалуйста, свяжитесь с нашей службой поддержки.\n\nМы доступны с понедельника по пятницу с 9:00 до 18:00.\n\nТелефон: +7 (7172) 645719 (вн. 2137)\nЭлектронная почта: helpdesk@astanait.edu.kz; helpdeskit@astanait.edu.kz\n\nМы всегда рады помочь вам!";
    public const string MapLink = "Ссылка на карту университета: https://yuujiso.github.io/aitumap/";
    public const string HelpText = $@"Здравствуйте! Я ваш помощник-бот технической поддержки. Вот что я могу предложить:

Написать письмо: Вы можете отправить письмо на почту тех поддержки прямо через меня. Просто укажите тему и сообщение, и я перешлю его нужному специалисту.

Телефонный справочник: Если вам нужно узнать контактную информацию сотрудников — номер телефона или почту, достаточно ввести ключевое слово (название департамента, должность или имя сотрудника), и я предоставлю необходимые данные.

Получить инструкцию: Получите пошаговую инструкцию по использованию различных сервисов университета. Это может быть полезно для новых студентов и сотрудников, а также в случаях внедрения новых сервисов.

Контакты тех поддержки: Узнайте актуальную информацию о тех поддержке, включая номер телефона, почту и график работы. 

Карта университета: Используйте интерактивную карту университета, чтобы найти любой кабинет или помещение. Это удобно для ориентирования на территории университета, особенно для новичков.";
}